app/controllers/auth_controller.rb

    def signup
        user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"