app/controllers/favorites_controller.rb

    def index
        favorite = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def show
        favorite = Favorite.find_by(id: params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        favorite = Favorite.create(favorite_params)
---
INSERT INTO "favorites" ("movieName", "movie_id", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["movieName", "Free Guy"], ["movie_id", 550988], ["profile_id", 1], ["created_at", "2021-08-18 12:27:56.432288"], ["updated_at", "2021-08-18 12:27:56.432288"]]

    def destroy
        favorite = Favorite.find_by(id: params[:id])
        favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]