app/controllers/genres_controller.rb

    def index
        genre = Genre.all
---
SELECT "genres".* FROM "genres"