app/controllers/profiles_controller.rb

    def show
        profile = Profile.find_by(id: params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def update
        profile = Profile.find_by(id: params[:id])
        profile.update(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "profiles" SET "fav_actor" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["fav_actor", "comedy"], ["updated_at", "2021-08-20 16:58:58.670005"], ["id", 1]]

    def destroy
        profile = Profile.find_by(id: params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def index
        profile = Profile.all
---
SELECT "profiles".* FROM "profiles"